  You are loading a legacy samtools module, please load a up to date module
instead:
  
    module load container_env samtools
  
  Please run samtools command with "crun.samtools" prepend to it, for example:
  
    crun.samtools samtools
  
  Otherwise you will get "command not found" error. 


fltrVCF.bash v4.4 -- a script to filter vcf files repeatably

Dependencies required for fltrVCF to be fully functional:
	R
		tidyverse
		gridExtra
	vcftools
	vcflib
	samtools
	perl
	mawk
	parallel
	rad_haplotyper.pl https://github.com/cbirdlab/rad_haplotyper.git
	filter_hwe_by_pop_HPC

Mon Aug 7 14:55:22 EDT 2023 Reading options from command line:

	Settings File:            config.fltr.ind.cssl

Mon Aug 7 14:55:22 EDT 2023 Reading options from config file and setting defaults
	SETTINGS are being loaded from file: 'config.fltr.ind.cssl'
	Filters are set to '01 02 03 04 14 07 05 16 15 06 11 09 10 04 13 05 16 07'
	CutoffCode is set to '.rad.RAW-2-2'
	BAM_PATH is set to '../mkBAMmerge'
	SCRIPT_PATH is set to '../../scripts/fltrVCF/scripts'
	VCF_FILE is set to '../mkBAMmerge/TotalRawSNPs.rad.RAW-2-2.vcf'
	Bed file is set to '../mkBAMmerge/mapped.rad.RAW-2-2.bed'
	Reference genome is set to '../mkBAMmerge/reference.rad.RAW-2-2.fasta'
	PopMap is set to '../mkBAMmerge/popmap.rad.RAW-2-2'
	HWE_SCRIPT is set to '../../scripts/fltrVCF/filter_hwe_by_pop_HPC.pl'
	RADHAP_SCRIPT is set to '../../scripts/rad_haplotyper/rad_haplotyper.pl'
	Output file prefix is set to 'Leq.A'
	The number of threads is set to '40'
	-P not set by user. Only filters that natively support parallelization will be run in parallel.
	../mkBAMmerge/TotalRawSNPs.rad.RAW-2-2.vcf will be used for serial processing.

Mon Aug 7 14:55:22 EDT 2023 Getting universal chromosome/contig prefix ...
          Querying ../mkBAMmerge/TotalRawSNPs.rad.RAW-2-2.vcf ...
          Prefix: 
          It is assumed that all values in the CHROM column of vcf begin with 
          If this is not the case, then fltrVCF will not work properly.
          The prefix is used to count SNPs/variants, contigs, etc and is used in some filters.

Mon Aug 7 14:55:22 EDT 2023  reading variables into MAIN

Mon Aug 7 14:55:22 EDT 2023 ---------------------------FILTER01: Remove sites with Y < alleles < X -----------------------------
     vcftools --vcf ../mkBAMmerge/TotalRawSNPs.rad.RAW-2-2.vcf --min-alleles 2 --max-alleles 2 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr01.1.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:23 EDT 2023 ---------------------------FILTER02: Remove Sites with Indels -----------------------------
     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr01.1.recode.vcf --remove-indels --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr02.2.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:23 EDT 2023 ---------------------------FILTER03: Remove Sites with QUAL < minQ -----------------------------
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'QUALbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'QUALbefore' pt "*" 
                                  ^
         line 0: x range is invalid

     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr02.2.recode.vcf --minQ 100 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr03.3.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:24 EDT 2023 ---------------------------FILTER04: Remove Sites With Mean Depth of Coverage < min-meanDP -----------------------------
cut: Leq.A.rad.RAW-2-2.Fltr04.4.ldepth.mean: No such file or directory
cut: Leq.A.rad.RAW-2-2.Fltr04.4.ldepth.mean: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' pt "*" 
                                           ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthVSvariance' pt "*"
                                          ^
         line 0: x range is invalid

     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr03.3.recode.vcf --min-meanDP 5 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr04.4.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:25 EDT 2023 ---------------------------FILTER14: If individual's genotype has DP < X, convert to missing data -----------------------------
cut: Leq.A.rad.RAW-2-2.Fltr14.5.gdepth: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'genotypedepthbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'genotypedepthbefore' pt "*" 
                                           ^
         line 0: x range is invalid

     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr04.4.recode.vcf --minDP 5 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr14.5.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:26 EDT 2023 ---------------------------FILTER07: Remove sites with Alternate Allele Count <=X -----------------------------
     vcffixup Leq.A.rad.RAW-2-2.Fltr14.5.recode.vcf | vcffilter -s -f "AC > 0 & AN - AC > 0"  > Leq.A.rad.RAW-2-2.Fltr07.6.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Aug 7 14:55:26 EDT 2023 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: Leq.A.rad.RAW-2-2.Fltr05.7.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*" 
                                       ^
         line 0: x range is invalid

     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr07.6.vcf --max-missing 0.45 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr05.7.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:27 EDT 2023 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
mawk: cannot open Leq.A.rad.RAW-2-2.Fltr16.8.imiss (No such file or directory)
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'totalmissing' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                  ^
         line 0: all points y value undefined!

         line 0: Non-numeric string found where a numeric expression was expected

         line 0: warning: Skipping data file with no valid points
         line 0: Can't plot with an empty x range!

mawk: cannot open Leq.A.rad.RAW-2-2.Fltr16.8.imiss (No such file or directory)
 0 individuals|libraries with too much missing data:
     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr05.7.recode.vcf --remove Leq.A.rad.RAW-2-2.Fltr16.8.lowDP-2.indv --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr16.8.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Mon Aug 7 14:55:28 EDT 2023 ---------------------------FILTER15: Remove sites with maf > minor allele frequency > max-maf -----------------------------
     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr16.8.recode.vcf --maf 0 --max-maf 1 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr15.9.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:28 EDT 2023 ---------------------------FILTER06: Remove sites with Average Allele Balance deviating too far from 0.5 while keeping those with AB=0  -----------------------------
/home/e1garcia/shotgun_PIRE/pire_cssl_data_processing/scripts/fltrVCF/fltrVCF.bash: line 555: vcf-query: command not found
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'siteAB.dat' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'siteAB.dat' pt "*" 
                                  ^
         line 0: x range is invalid

     vcffixup Leq.A.rad.RAW-2-2.Fltr15.9.recode.vcf | vcffilter -s -f "AB > 0.375 & AB < 0.625 | AB = 0"  > Leq.A.rad.RAW-2-2.Fltr06.10.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Aug 7 14:55:29 EDT 2023 ---------------------------FILTER11: Remove sites with Quality/DP ratio < X -----------------------------
     vcffilter -s -f "QUAL / DP > 0.2" Leq.A.rad.RAW-2-2.Fltr06.10.vcf > Leq.A.rad.RAW-2-2.Fltr11.11.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Aug 7 14:55:29 EDT 2023 ---------------------------FILTER09: Remove sites with low/high ratio of mean mapping quality of alt to ref -----------------------------
     vcffilter -s -f "MQM / MQMR > 0.75 & MQM / MQMR < 1.33333" Leq.A.rad.RAW-2-2.Fltr11.11.vcf > Leq.A.rad.RAW-2-2.Fltr09.12.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Aug 7 14:55:30 EDT 2023 ---------------------------FILTER10: Remove sites with one allele only supported by reads not properly paired -----------------------------
     vcffilter -s -f "PAIRED > 0.05 & PAIREDR > 0.05 & PAIREDR / PAIRED < 1.75 & PAIREDR / PAIRED > 0.25 | PAIRED < 0.05 & PAIREDR < 0.05" Leq.A.rad.RAW-2-2.Fltr09.12.vcf > Leq.A.rad.RAW-2-2.Fltr10.13.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Aug 7 14:55:30 EDT 2023 ---------------------------FILTER04: Remove Sites With Mean Depth of Coverage < min-meanDP -----------------------------
cut: Leq.A.rad.RAW-2-2.Fltr04.14.ldepth.mean: No such file or directory
cut: Leq.A.rad.RAW-2-2.Fltr04.14.ldepth.mean: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' pt "*" 
                                           ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthVSvariance' pt "*"
                                          ^
         line 0: x range is invalid

     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr10.13.vcf --min-meanDP 15 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr04.14.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:31 EDT 2023 ---------------------------FILTER13: Remove sites with mean DP greater than X  -----------------------------
cut: Leq.A.rad.RAW-2-2.Fltr13.15.ldepth: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthpersitebefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                            ^
         line 0: x range is invalid

     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr04.14.recode.vcf --max-meanDP 400 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr13.15.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:31 EDT 2023 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: Leq.A.rad.RAW-2-2.Fltr05.16.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*" 
                                       ^
         line 0: x range is invalid

     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr13.15.recode.vcf --max-missing 0.45 --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr05.16.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Aug 7 14:55:32 EDT 2023 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
mawk: cannot open Leq.A.rad.RAW-2-2.Fltr16.17.imiss (No such file or directory)
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'totalmissing' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                  ^
         line 0: all points y value undefined!

         line 0: Non-numeric string found where a numeric expression was expected

         line 0: warning: Skipping data file with no valid points
         line 0: Can't plot with an empty x range!

mawk: cannot open Leq.A.rad.RAW-2-2.Fltr16.17.imiss (No such file or directory)
 0 individuals|libraries with too much missing data:
     vcftools --vcf Leq.A.rad.RAW-2-2.Fltr05.16.recode.vcf --remove Leq.A.rad.RAW-2-2.Fltr16.17.lowDP-2.indv --recode --recode-INFO-all --out Leq.A.rad.RAW-2-2.Fltr16.17.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Mon Aug 7 14:55:33 EDT 2023 ---------------------------FILTER07: Remove sites with Alternate Allele Count <=X -----------------------------
     vcffixup Leq.A.rad.RAW-2-2.Fltr16.17.recode.vcf | vcffilter -s -f "AC > 0 & AN - AC > 0"  > Leq.A.rad.RAW-2-2.Fltr07.18.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Aug 7 14:55:33 EDT 2023  --------------------------- Filtering complete! ---------------------------

