


fltrVCF.bash v4.4 -- a script to filter vcf files repeatably

Dependencies required for fltrVCF to be fully functional:
	R
		tidyverse
		gridExtra
	vcftools
	vcflib
	samtools
	perl
	mawk
	parallel
	rad_haplotyper.pl https://github.com/cbirdlab/rad_haplotyper.git
	filter_hwe_by_pop_HPC

Mon Jul 10 10:44:42 EDT 2023 Reading options from command line:

	Settings File:            config.fltr.ind.cssl

Mon Jul 10 10:44:42 EDT 2023 Reading options from config file and setting defaults
	SETTINGS are being loaded from file: 'config.fltr.ind.cssl'
	Filters are set to '01 02 03 04 14 07 05 16 15 06 11 09 10 04 13 05 16 07'
	CutoffCode is set to '.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate'
	BAM_PATH is set to '../mkBAMmerge'
	SCRIPT_PATH is set to '../../scripts/fltrVCF/scripts'
	VCF_FILE is set to '../mkBAMmerge/TotalRawSNPs.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.vcf'
	Bed file is set to '../mkBAMmerge/mapped.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.bed'
	Reference genome is set to '../1st_sequencing_run/mkBAM/reference.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.fasta'
	PopMap is set to '../mkBAMmerge/popmap.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate'
	HWE_SCRIPT is set to '../../scripts/fltrVCF/filter_hwe_by_pop_HPC.pl'
	RADHAP_SCRIPT is set to '../../scripts/rad_haplotyper/rad_haplotyper.pl'
	Output file prefix is set to 'Tbi.A'
	The number of threads is set to '40'
	-P not set by user. Only filters that natively support parallelization will be run in parallel.
	../mkBAMmerge/TotalRawSNPs.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.vcf will be used for serial processing.

Mon Jul 10 10:44:42 EDT 2023 Getting universal chromosome/contig prefix ...
          Querying ../mkBAMmerge/TotalRawSNPs.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.vcf ...
          Prefix: 
          It is assumed that all values in the CHROM column of vcf begin with 
          If this is not the case, then fltrVCF will not work properly.
          The prefix is used to count SNPs/variants, contigs, etc and is used in some filters.

Mon Jul 10 10:44:42 EDT 2023  reading variables into MAIN

Mon Jul 10 10:44:42 EDT 2023 ---------------------------FILTER01: Remove sites with Y < alleles < X -----------------------------
     vcftools --vcf ../mkBAMmerge/TotalRawSNPs.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.vcf --min-alleles 2 --max-alleles 2 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr01.1.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:43 EDT 2023 ---------------------------FILTER02: Remove Sites with Indels -----------------------------
     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr01.1.recode.vcf --remove-indels --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr02.2.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:43 EDT 2023 ---------------------------FILTER03: Remove Sites with QUAL < minQ -----------------------------
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'QUALbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'QUALbefore' pt "*" 
                                  ^
         line 0: x range is invalid

     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr02.2.recode.vcf --minQ 100 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr03.3.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:45 EDT 2023 ---------------------------FILTER04: Remove Sites With Mean Depth of Coverage < min-meanDP -----------------------------
cut: Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr04.4.ldepth.mean: No such file or directory
cut: Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr04.4.ldepth.mean: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' pt "*" 
                                           ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthVSvariance' pt "*"
                                          ^
         line 0: x range is invalid

     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr03.3.recode.vcf --min-meanDP 5 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr04.4.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:45 EDT 2023 ---------------------------FILTER14: If individual's genotype has DP < X, convert to missing data -----------------------------
cut: Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr14.5.gdepth: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'genotypedepthbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'genotypedepthbefore' pt "*" 
                                           ^
         line 0: x range is invalid

     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr04.4.recode.vcf --minDP 5 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr14.5.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:46 EDT 2023 ---------------------------FILTER07: Remove sites with Alternate Allele Count <=X -----------------------------
     vcffixup Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr14.5.recode.vcf | vcffilter -s -f "AC > 0 & AN - AC > 0"  > Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr07.6.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Jul 10 10:44:46 EDT 2023 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr05.7.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*" 
                                       ^
         line 0: x range is invalid

     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr07.6.vcf --max-missing 0.55 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr05.7.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:46 EDT 2023 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
mawk: cannot open Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.8.imiss (No such file or directory)
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'totalmissing' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                  ^
         line 0: all points y value undefined!

         line 0: Non-numeric string found where a numeric expression was expected

         line 0: warning: Skipping data file with no valid points
         line 0: Can't plot with an empty x range!

mawk: cannot open Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.8.imiss (No such file or directory)
 0 individuals|libraries with too much missing data:
     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr05.7.recode.vcf --remove Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.8.lowDP-2.indv --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.8.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Mon Jul 10 10:44:47 EDT 2023 ---------------------------FILTER15: Remove sites with maf > minor allele frequency > max-maf -----------------------------
     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.8.recode.vcf --maf 0 --max-maf 1 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr15.9.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:47 EDT 2023 ---------------------------FILTER06: Remove sites with Average Allele Balance deviating too far from 0.5 while keeping those with AB=0  -----------------------------
/home/e1garcia/shotgun_PIRE/pire_cssl_data_processing/scripts/fltrVCF/fltrVCF.bash: line 555: vcf-query: command not found
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'siteAB.dat' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'siteAB.dat' pt "*" 
                                  ^
         line 0: x range is invalid

     vcffixup Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr15.9.recode.vcf | vcffilter -s -f "AB > 0.375 & AB < 0.625 | AB = 0"  > Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr06.10.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Jul 10 10:44:47 EDT 2023 ---------------------------FILTER11: Remove sites with Quality/DP ratio < X -----------------------------
     vcffilter -s -f "QUAL / DP > 0.2" Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr06.10.vcf > Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr11.11.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Jul 10 10:44:48 EDT 2023 ---------------------------FILTER09: Remove sites with low/high ratio of mean mapping quality of alt to ref -----------------------------
     vcffilter -s -f "MQM / MQMR > 0.75 & MQM / MQMR < 1.33333" Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr11.11.vcf > Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr09.12.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Jul 10 10:44:48 EDT 2023 ---------------------------FILTER10: Remove sites with one allele only supported by reads not properly paired -----------------------------
     vcffilter -s -f "PAIRED > 0.05 & PAIREDR > 0.05 & PAIREDR / PAIRED < 1.75 & PAIREDR / PAIRED > 0.25 | PAIRED < 0.05 & PAIREDR < 0.05" Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr09.12.vcf > Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr10.13.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Jul 10 10:44:48 EDT 2023 ---------------------------FILTER04: Remove Sites With Mean Depth of Coverage < min-meanDP -----------------------------
cut: Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr04.14.ldepth.mean: No such file or directory
cut: Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr04.14.ldepth.mean: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' pt "*" 
                                           ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthVSvariance' pt "*"
                                          ^
         line 0: x range is invalid

     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr10.13.vcf --min-meanDP 15 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr04.14.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:48 EDT 2023 ---------------------------FILTER13: Remove sites with mean DP greater than X  -----------------------------
cut: Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr13.15.ldepth: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthpersitebefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                            ^
         line 0: x range is invalid

     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr04.14.recode.vcf --max-meanDP 400 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr13.15.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:49 EDT 2023 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr05.16.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*" 
                                       ^
         line 0: x range is invalid

     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr13.15.recode.vcf --max-missing 0.6 --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr05.16.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Mon Jul 10 10:44:49 EDT 2023 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
mawk: cannot open Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.17.imiss (No such file or directory)
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'totalmissing' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                  ^
         line 0: all points y value undefined!

         line 0: Non-numeric string found where a numeric expression was expected

         line 0: warning: Skipping data file with no valid points
         line 0: Can't plot with an empty x range!

mawk: cannot open Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.17.imiss (No such file or directory)
 0 individuals|libraries with too much missing data:
     vcftools --vcf Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr05.16.recode.vcf --remove Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.17.lowDP-2.indv --recode --recode-INFO-all --out Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.17.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Mon Jul 10 10:44:49 EDT 2023 ---------------------------FILTER07: Remove sites with Alternate Allele Count <=X -----------------------------
     vcffixup Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr16.17.recode.vcf | vcffilter -s -f "AC > 0 & AN - AC > 0"  > Tbi.A.ssl.Tbi-C_scaffolds_32R_spades_contam_R1R2ORPH_noisolate.Fltr07.18.vcf
	Sites remaining:	0
	Contigs remaining:	0

Mon Jul 10 10:44:50 EDT 2023  --------------------------- Filtering complete! ---------------------------

